---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCoupler.GetCoupledReinforcementData
source: html/f6b701e8-73e3-3ca1-bb8b-c9bbea755be1.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler.GetCoupledReinforcementData Method

gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null.

## Syntax (C#)
```csharp
public IList<ReinforcementData> GetCoupledReinforcementData()
```